# Selecting Data Lab

In this lab, we will practice writing `SELECT` statements to query a database.

## Objectives

1.  Use the `SELECT *` statement to pull all values from a table
2.  Use `SELECT` and specify `column_name(s)` to pull only certain columns from a table
3.  Use `WHERE` and conditionals to pull more specific information from a table

We created a `dogs` table and seeded it with information about eight famous bowsers.  Let's practice writing different `SELECT` statements to query from this table.  The `dogs` table is featured below:

In [54]:
%sql SELECT * FROM dogs;

 * sqlite://
Done.

[(1, 'Snoopy', 3, 'M', 'beagle', 'friendly'),
 (2, 'McGruff', 10, 'M', 'bloodhound', 'observant'),
 (3, 'Scooby', 6, 'M', 'great dane', 'hungry'),
 (4, 'Little Ann', 5, 'F', 'coonhound', 'loyal'),
 (5, 'Pickles', 13, 'F', 'black lab', 'mischevious'),
 (6, 'Clifford', 4, 'M', 'big red', 'smiley'),
 (7, 'Lassie', 7, 'F', 'collie', 'loving'),
 (8, 'Snowy', 8, 'F', 'fox terrier', 'adventurous')]

#### Selecting all rows

Write a function called `select_all` that returns all columns and rows from our table.

In [58]:
%sql SELECT * FROM dogs;

 * sqlite://
Done.

[(1, 'Snoopy', 3, 'M', 'beagle', 'friendly'),
 (2, 'McGruff', 10, 'M', 'bloodhound', 'observant'),
 (3, 'Scooby', 6, 'M', 'great dane', 'hungry'),
 (4, 'Little Ann', 5, 'F', 'coonhound', 'loyal'),
 (5, 'Pickles', 13, 'F', 'black lab', 'mischevious'),
 (6, 'Clifford', 4, 'M', 'big red', 'smiley'),
 (7, 'Lassie', 7, 'F', 'collie', 'loving'),
 (8, 'Snowy', 8, 'F', 'fox terrier', 'adventurous')]

In [59]:
%sql SELECT name, breed FROM dogs;

 * sqlite://
Done.

[('Snoopy', 'beagle'),
 ('McGruff', 'bloodhound'),
 ('Scooby', 'great dane'),
 ('Little Ann', 'coonhound'),
 ('Pickles', 'black lab'),
 ('Clifford', 'big red'),
 ('Lassie', 'collie'),
 ('Snowy', 'fox terrier')]

In [63]:
%sql SELECT name, gender FROM dogs WHERE gender = "F";

 * sqlite://
Done.

[('Little Ann', 'F'), ('Pickles', 'F'), ('Lassie', 'F'), ('Snowy', 'F')]

In [71]:
%sql SELECT name, temperament FROM dogs WHERE temperament = "friendly" OR temperament = "smiley";

 * sqlite://
Done.

[('Snoopy', 'friendly'), ('Clifford', 'smiley')]

In [73]:
%sql SELECT * FROM dogs WHERE age < 7;

 * sqlite://
Done.

[(1, 'Snoopy', 3, 'M', 'beagle', 'friendly'),
 (3, 'Scooby', 6, 'M', 'great dane', 'hungry'),
 (4, 'Little Ann', 5, 'F', 'coonhound', 'loyal'),
 (6, 'Clifford', 4, 'M', 'big red', 'smiley')]

In [74]:
%sql SELECT * FROM dogs WHERE age > 7 AND breed = "black lab";

 * sqlite://
Done.

[(5, 'Pickles', 13, 'F', 'black lab', 'mischevious')]